app/views/theatres/index.html.erb

SELECT COUNT(*) FROM `movies` INNER JOIN `show_times` ON `movies`.`id` = `show_times`.`movie_id` WHERE `show_times`.`theatre_id` = 1
---
      <td><%= number_to_currency(theater.price) %></td>
      <td><%= theater.movies.size %></td>