app/views/movies/index.html.erb

      <td><%= movie.rated %></td>
      <td><%= movie.theatres.size %></td>
---
SELECT COUNT(*) FROM `theatres` INNER JOIN `show_times` ON `theatres`.`id` = `show_times`.`theatre_id` WHERE `show_times`.`movie_id` = 1