app/views/movies/show.html.erb

SELECT COUNT(*) FROM `theatres` INNER JOIN `show_times` ON `theatres`.`id` = `show_times`.`theatre_id` WHERE `show_times`.`movie_id` = 1
---
      <th>Number of Theatres Movie is Playing In </th>
      <td><%= @movie.theatres.size %> </td>