app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @movie = Movie.find(comment_params[:movie_id])
    if @comment.save
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = NULL LIMIT 1
INSERT INTO `comments` (`movie_id`, `title`, `name`, `comment`, `created_at`, `updated_at`) VALUES (2, 'Deadpool Movie Review', 'Bob Smith', 'A great movie!', '2017-09-03 17:58:38', '2017-09-03 17:58:38')