app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(:name)
---
SELECT `movies`.* FROM `movies` ORDER BY `movies`.`name` ASC

  def show
    @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def create
    #Instantiate a new object using form parameters
    @movie = Movie.new(movie_params)
    #Save the object
    if @movie.save
---
INSERT INTO `movies` (`name`, `rated`, `year`, `director`, `genre`, `description`, `created_at`, `updated_at`) VALUES ('The Boss Baby', 'PG', 2017, 'Tom McGrath', 'Comedy', '', '2017-08-24 20:18:59', '2017-08-24 20:18:59')

  def edit
    @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def update
    #Find an exisiting object using form parameters
    @movie = Movie.find(params[:id])
    #Update the object
    if @movie.update_attributes(movie_params)
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 2 LIMIT 1
UPDATE `movies` SET `year` = 1940, `description` = 'A baby shows up from Baby Corp. and turns a kid\'s life upside down', `updated_at` = '2017-08-24 20:19:38' WHERE `movies`.`id` = 2

  def delete
    @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def destroy
    @movie = Movie.find(params[:id])
    @movie.show_times.destroy_all
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
DELETE FROM `movies` WHERE `movies`.`id` = 1