app/controllers/show_times_controller.rb

SELECT `show_times`.* FROM `show_times`
---
  def index
    @showtimes = ShowTime.all