app/controllers/theatres_controller.rb

  def index
    @theatres = Theatre.order(:name)
---
SELECT `theatres`.* FROM `theatres` ORDER BY `theatres`.`name` ASC

  def show
    @theatre = Theatre.find(params[:id])
---
SELECT  `theatres`.* FROM `theatres` WHERE `theatres`.`id` = 1 LIMIT 1

  def create
    @theatre = Theatre.new(theatre_params)
    if @theatre.save
---
INSERT INTO `theatres` (`name`, `price_cents`, `created_at`, `updated_at`) VALUES ('Pacific', 1095, '2017-07-11 16:30:39', '2017-07-11 16:30:39')

  def edit
    @theatre = Theatre.find(params[:id])
---
SELECT  `theatres`.* FROM `theatres` WHERE `theatres`.`id` = 1 LIMIT 1

  def update
    @theatre = Theatre.find(params[:id])
    if @theatre.update_attributes(theatre_params)
---
SELECT  `theatres`.* FROM `theatres` WHERE `theatres`.`id` = 1 LIMIT 1
UPDATE `theatres` SET `name` = 'test', `price` = 12, `updated_at` = '2017-07-10 23:36:35' WHERE `theatres`.`id` = 1

  def delete
    @theatre = Theatre.find(params[:id])
---
SELECT  `theatres`.* FROM `theatres` WHERE `theatres`.`id` = 2 LIMIT 1

  def destroy
    @theatre = Theatre.find(params[:id]).destroy
---
DELETE FROM `theatres` WHERE `theatres`.`id` = 3
SELECT  `theatres`.* FROM `theatres` WHERE `theatres`.`id` = 3 LIMIT 1